{
  "backend/main.mo": "Motoko actor implementing access‑controlled user profiles and order storage with queries and mutations for users and admins.",
  "feature_evidence.json": "Feature evidence report linking a text‑update requirement to the affected frontend file and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files describing their purpose and functionality.",
  "frontend/GO_LIVE.md": "Go‑live runbook detailing pre‑flight checks, business info verification, and deployment steps with no code changes allowed.",
  "frontend/index.css": "Global Tailwind base styles defining brand color tokens and dark‑mode variants using OKLCH values.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/SMOKE_CHECK_PRODUCTION.md": "Production smoke‑test checklist for verifying core functionality, assets, and UI after deployment.",
  "frontend/src/App.tsx": "Main React component orchestrating layout, authentication, dialogs, and order flow.",
  "frontend/src/components/Contact.tsx": "Contact section showing phone, location, and Instagram info from BUSINESS_INFO.",
  "frontend/src/components/Footer.tsx": "Footer displaying business details, social link, and caffeine.ai attribution.",
  "frontend/src/components/Header.tsx": "Renders the site header with logo, business info, and phone/Instagram action buttons.",
  "frontend/src/components/Hero.tsx": "Displays the hero section with background image, tagline, and buttons for ordering or viewing speciality.",
  "frontend/src/components/LoginButton.tsx": "Provides login/logout handling using Internet Identity with loading states and error recovery.",
  "frontend/src/components/OrderDialog.tsx": "Implements a form dialog to submit custom bat orders and shows a success message after submission.",
  "frontend/src/components/Products.tsx": "Shows a grid of product features highlighting bat quality and construction.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Displays a dialog prompting users to enter and save basic profile information.",
  "frontend/src/components/Speciality.tsx": "Presents speciality information with three cards describing customization options.",
  "frontend/src/config/business.ts": "Defines all business information used throughout the site including contact details and tagline.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, exposing identity, login, logout, and status helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles and orders through an ICP actor.",
  "frontend/src/index.css": "Tailwind base styles with extensive OKLCH CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Sets up the React root with QueryClientProvider and InternetIdentityProvider before rendering the app.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, animations, and container settings using CSS variable‑based OKLCH themes.",
  "project_state.json": "Metadata describing project state, features, and pending requests for the Meerut Tennis Bats project."
}